/* "Alert body when trying to download a file and it is not in the right format" */
"alert.message.notValidData" = "Kann nicht Antwort JSON parsen";

/* If something went wrong, but the writing was generally successful */
" However, there was an error writing one or more of the files" = " Allerdings gab es einen Fehler beim Schreiben einer oder mehrerer Dateien";

/* Actionsheet message for stating that nothing was generated  */
"An error has occurred and no files have been generated." = "Es gab einen Fehler und keine Dateien wurden generiert.";

/* Title of an alert if there is an error getting content of a url */
"An Error Occurred" = "Es gab einen Fehler";

/* The title for the action sheet saying something went wrong */
"An error occurred while verifying the JSON" = "Es gab einen Fehler während der JSON-Verifizierung";

/* Cancel button in the overwrite files prompt */
"Cancel" = "Abbrechen";

/* Label to have the user select which folder to choose */
"Choose" = "Auswählen";

/* Button to dismiss an action sheet */
"OK" = "OK";

/* Prompt user gets to enter a URL */
"Enter URL..." = "URL eingeben...";

/* No comment provided by engineer. */
"Expected content type %@, got %@" = "Erwarteter Inhalt %1$@, erhielt %2$@";

/* No comment provided by engineer. */
"Expected status code %@, got %d" = "Erwarteter Inhalt %1$@, erhielt %2$d";

/* Toolbar item name for General Preferences */
"General" = "Übersicht";

/* In the main screen, this is the button that writes out files */
"Generate Files" = "Dateien generieren";

/* In the main screen, this is the button that fetches data from a URL */
"Get Data" = "Daten laden";

/* Error message to state the JSON didn't start with a {} or [] */
"JSON text did not start with array or object." = "JSON-Text begann nicht mit einem Array oder Objekt.";

/* Message when writing the files, nothing was written */
"No file were written to the disk" = "Keine Datei wurde auf die Disk geschrieben";

/* This is the current title of http options window that gets written */
"Options" = "Optionen";

/* In the save portion, the label to choose what language */
"Output Language" = "Output-Sprache";

/* Button text to overwrite files */
"Overwrite Files" = "Dateien überschreiben";

/* The title of the prompt to tell the user they are about to overwrite the files in the existing application */
"Overwrite files?" = "Dateien überschreiben?";

/* In the save portion, the label to choose what the package is */
"Package Name" = "Paketname";

/* In the save portion, the prompt to specify what the base class is */
"Base Class" = "Basisklasse";

/* Message in an actionsheet stating that the write is successful */
"Success!" = "Erfolg!";

/* If there is nothing in the JSON field, state that there is nothing there */
"There is no content to parse." = "Es gibt keine Daten zu analysieren.";

/* The prompt to tell the user they are about to overwrite the files in the existing application */
"This operation will overwrite files in this directory. Are you sure you want to continue?" = "Eine Datei oder ein Ordner mit diesem Namen existiert bereits am Zielort. Ein Ersetzen wird den derzeitigen Inhalt überschreiben.";

/* In the main screen, this is the verify button that formats the JSON */
"Verify" = "Prüfen";

/* Success message in an action sheet */
"Your files have successfully been generated." = "Ihre Dateien wurden erfolgreich generiert.";

/* In the save portion, for objective C, determine whether or not to use ARC */
"Use Automatic Reference Counting" = "Automatische Referenzzählung benutzen";

/* "The letters to prepend to the file */
"Class Prefix" = "Dateipräfix";

/*************** HTTP OPTIONS WINDOW STRINGS *************/

/* Title for the Method box in the HTTP Options window */
"Method" = "Methode";

/* Title for the Headers box in the HTTP Options window */
"Headers" = "Kopfzeilen";

/* Title for the field to enter a HTTP header key */
/* Title for the column of HTTP header keys */
"Key" = "Schlüssel";

/* Title for the field to enter a HTTP header value */
/* Title for the column of HTTP header values */
"Value" = "Wert";

/* Title for the Add header button in the HTTP Options window */
"Add" = "Hinzufügen";







